#!/usr/bin/python
# -*- coding:utf-8 -*-
# -----------------------------------------------------------
# File Name: toolbarmapping
# Author:    fan
# date:      2018/3/10
# -----------------------------------------------------------


def get_x_y(text_name):
    menu_plc = {'PLC上传': (676, 89),
                'PLC下载': (679, 109),
                'PLC校验': (753, 66),
                '监控模式': (580, 89),
                '编辑模式': (583, 66),
                '监控编辑': (583, 106),
                'PLC诊断': (752, 88),
                '远程操作': (752, 106),
                '软元件监视': (849, 66),
                '模块监视': (839, 87),
                '清除PLC内存': (846, 110),
                'PLC时钟设置': (941, 64),
                '程序检查': (1034, 67),
                '离线模拟': (1034, 87),
                '定时保存设置': (1034, 107),
                'PLC和程序加密工具': (1154, 66),
                '生成下载文件': (1145, 88),
                'PLC向导': (1119, 108),
                'U盘下载': (1248, 66),
                '编译': (505, 66),
                '切换': (505, 86),
                '注释编辑': (430, 66),
                '声明编辑': (430, 86),
                'PLC类型更改': (52, 66),
                '粘贴': (138, 66),
                '剪切': (138, 86),
                '复制': (138, 106),
                '撤销': (191, 66),
                '重做': (191, 86),
                '视图': (128, 41),
                '帮助': (179, 40)}
    menu_view = {'状态栏': (37, 66),
                 '工程管理': (37, 86),
                 '输出窗口': (37, 106),
                 '搜索替换': (126, 66),
                 'PLC校验结果': (126, 86),
                 '交叉对照表': (126, 106),
                 '软元件使用列表': (232, 66),
                 '注释显示': (337, 66),
                 '别名显示': (337, 86),
                 '缩放': (430, 66)}
    menu_help = {'语言类型': (45, 66),
                 '网站': (124, 88),
                 '帮助': (176, 88),
                 '关于': (234, 88)}
    temp = menu_plc.copy()
    temp.update(menu_view)
    temp.update(menu_help)
    if text_name in temp.keys():
        return temp[text_name]

if __name__ == '__main__':
    get_x_y('')
