#!/usr/bin/python
# -*- coding:utf-8 -*-
# -----------------------------------------------------------
# File Name: toolbarmapping
# Author:    fan
# date:      2018/3/10
# -----------------------------------------------------------


def get_x_y(text_name):
    buttons = {'PLC上传': (676, 89),
               'PLC下载': (679, 109),
               'PLC校验': (753, 68),
               '监控模式': (580, 89),
               '编辑模式': (),
               '监控编辑': (),
               'PLC诊断': (),
               '远程操作': (),
               '软元件监视': (),
               '模块监视': (),
               '清除PLC内存': (),
               'PLC时钟设置': (),
               '程序检查': (),
               '离线模拟': (),
               '定时保存设置': (),
               'PLC和程序加密工具': (),
               '生成下载文件': (),
               'PLC向导': (),
               'U盘下载': (),
               '编译': (),
               '切换': (),
               '注释编辑': (),
               '声明编辑': (),
               'PLC类型更改': (),
               '粘贴': (),
               '剪切': (),
               '复制': (),
               '撤销': (),
               '重做': (),
               '视图': (),
               '帮助': ()}
    chkbx = {'状态栏': (),
             '工程管理': (),
             '输出窗口': (),
             '搜索替换': (),
             'PLC校验结果': (),
             '交叉对照表': (),
             '软元件使用列表': (),
             '注释显示': (),
             '别名显示': ()}
    hlp = {'语言类型': (),
           '网站': (),
           '帮助': (),
           '关于': ()}

if __name__ == '__main__':
    pass
